### Bootcamp Cientista de dados
Explorando os dados  disponíveis em https://www.kaggle.com/camnugent/sandp500/ (arquivo all_stocks_5yr.csv) para entender as características e responder as perguntas propostas.

O arquivo contém, para cada dia e ação do
S&P 500 (lista de 500 maiores empresas americanas), os seguintes dados:
- Date - no formato yy-mm-dd
- Open - Preço da ação na abertura do mercado no dia, em dólares.
- High - Maior preço alcançado naquele dia.
- Low - Menor preço alcançado naquele dia.
- Close - Preço da ação no fechamento do mercado no dia.
- Volume - Número de ações vendidas / compradas.
- Name - O nome da ação.

In [1]:
import pandas as pd

In [53]:
data = pd.read_csv("all_stocks_5yr.csv")

In [54]:
data.head()

         date   open   high    low  close    volume Name
0  2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1  2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2  2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3  2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4  2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL

In [6]:
data.describe()

,open,high,low,close,volume
count,619029.000000,619032.000000,619032.000000,619040.000000,6.190400e+05
mean,83.023334,83.778311,82.256096,83.043763,4.321823e+06
std,97.378769,98.207519,96.507421,97.389748,8.693610e+06
min,1.620000,1.690000,1.500000,1.590000,0.000000e+00
25%,40.220000,40.620000,39.830000,40.245000,1.070320e+06
50%,62.590000,63.150000,62.020000,62.620000,2.082094e+06
75%,94.370000,95.180000,93.540000,94.410000,4.284509e+06
max,2044.000000,2067.990000,2035.110000,2049.000000,6.182376e+08

In [55]:
#Quantos registros há na planilha?
len(data.index)

619040

In [13]:
#Quantos registros há na planilha para a ação da Apple (AAPL)? True
(data['Name'] == "AAPL").value_counts()

False    617781
True       1259
Name: Name, dtype: int64

In [97]:
#Quantas empresas distintas têm registros nessa planilha?
data.groupby(['Name']).count()

      date  open  high   low  close  volume
Name
A     1259  1259  1259  1259   1259    1259
AAL   1259  1259  1259  1259   1259    1259
AAP   1259  1259  1259  1259   1259    1259
AAPL  1259  1259  1259  1259   1259    1259
ABBV  1259  1259  1259  1259   1259    1259
...    ...   ...   ...   ...    ...     ...
XYL   1259  1259  1259  1259   1259    1259
YUM   1259  1259  1259  1259   1259    1259
ZBH   1259  1259  1259  1259   1259    1259
ZION  1259  1259  1259  1259   1259    1259
ZTS   1259  1259  1259  1259   1259    1259

[505 rows x 6 columns]

In [27]:
#Com qual frequência o preço de uma ação no fechamento é maior do que o preço na abertura?
(data['open']<data['close']).value_counts()

True     318970
False    300070
dtype: int64

In [29]:
(318970/(318970+300070))*100

51.52655724993538

In [ ]:
#Qual o maior valor das ações da Apple (AAPL) na história?

In [56]:
maior_valor = data.filter(items=['high','low','Name'])\
                  .groupby(['Name']).max()

In [57]:
maior_valor.head(6)

        high     low
Name
A      75.00   74.30
AAL    59.08   57.80
AAP   201.24  198.16
AAPL  180.10  178.25
ABBV  125.86  118.98
ABC   120.68  114.75

In [59]:
#Qual ação tem a maior volatilidade? 
#Uma forma é medir o desvio-padrão do preço de fechamento de cada ação e considerar a ação de maior desvio-padrão.

In [258]:
maior_volat = data.filter(items=['high','low','Name'])\
                  .groupby(['Name']).std().sort_values(by='high', ascending=False)
maior_volat[0:2]

            high         low
Name
PCLN  321.351969  319.458458
AMZN  284.417123  280.215237

In [386]:
#Qual o dia com maior volume total de negociação da bolsa?
maior_vol = data.filter(items=['Name','volume','date'])\
                  .groupby(['date']).sum().sort_values(by='volume', ascending=False)
maior_vol.head(2)

                volume
date
2015-08-24  4607945196
2016-06-24  4367393052

In [71]:
#Qual a ação mais negociada da bolsa, em volume de transações?
#Qual a ação menos negociada da bolsa, em volume de transações?

In [192]:
acao = data.filter(items=['volume','Name'])\
                  .groupby(['Name']).std().sort_values(by='volume', ascending=False)
acao.head(2)

            volume
Name
BAC   4.355989e+07
AAPL  3.346835e+07

In [197]:
acao.tail(2)

             volume
Name
AZO   195198.893059
MTD   169004.183294

In [172]:
unicos = data['Name'].unique()
b=unicos.astype(str)
b

array(['AAL', 'AAPL', 'AAP', 'ABBV', 'ABC', 'ABT', 'ACN', 'ADBE', 'ADI',
       'ADM', 'ADP', 'ADSK', 'ADS', 'AEE', 'AEP', 'AES', 'AET', 'AFL',
       'AGN', 'AIG', 'AIV', 'AIZ', 'AJG', 'AKAM', 'ALB', 'ALGN', 'ALK',
       'ALLE', 'ALL', 'ALXN', 'AMAT', 'AMD', 'AME', 'AMGN', 'AMG', 'AMP',
       'AMT', 'AMZN', 'ANDV', 'ANSS', 'ANTM', 'AON', 'AOS', 'APA', 'APC',
       'APD', 'APH', 'APTV', 'ARE', 'ARNC', 'ATVI', 'AVB', 'AVGO', 'AVY',
       'AWK', 'AXP', 'AYI', 'AZO', 'A', 'BAC', 'BAX', 'BA', 'BBT', 'BBY',
       'BDX', 'BEN', 'BF.B', 'BHF', 'BHGE', 'BIIB', 'BK', 'BLK', 'BLL',
       'BMY', 'BRK.B', 'BSX', 'BWA', 'BXP', 'CAG', 'CAH', 'CAT', 'CA',
       'CBG', 'CBOE', 'CBS', 'CB', 'CCI', 'CCL', 'CDNS', 'CELG', 'CERN',
       'CFG', 'CF', 'CHD', 'CHK', 'CHRW', 'CHTR', 'CINF', 'CI', 'CLX',
       'CL', 'CMA', 'CMCSA', 'CME', 'CMG', 'CMI', 'CMS', 'CNC', 'CNP',
       'COF', 'COG', 'COL', 'COO', 'COP', 'COST', 'COTY', 'CPB', 'CRM',
       'CSCO', 'CSRA', 'CSX', 'CTAS', 'CTL', 'CTSH', 'CTXS', 'CVS', 'CVX',
       'CXO', 'C', 'DAL', 'DE', 'DFS', 'DGX', 'DG', 'DHI', 'DHR', 'DISCA',
       'DISCK', 'DISH', 'DIS', 'DLR', 'DLTR', 'DOV', 'DPS', 'DRE', 'DRI',
       'DTE', 'DUK', 'DVA', 'DVN', 'DWDP', 'DXC', 'D', 'EA', 'EBAY',
       'ECL', 'ED', 'EFX', 'EIX', 'EL', 'EMN', 'EMR', 'EOG', 'EQIX',
       'EQR', 'EQT', 'ESRX', 'ESS', 'ES', 'ETFC', 'ETN', 'ETR', 'EVHC',
       'EW', 'EXC', 'EXPD', 'EXPE', 'EXR', 'FAST', 'FBHS', 'FB', 'FCX',
       'FDX', 'FE', 'FFIV', 'FISV', 'FIS', 'FITB', 'FLIR', 'FLR', 'FLS',
       'FL', 'FMC', 'FOXA', 'FOX', 'FRT', 'FTI', 'FTV', 'F', 'GD', 'GE',
       'GGP', 'GILD', 'GIS', 'GLW', 'GM', 'GOOGL', 'GOOG', 'GPC', 'GPN',
       'GPS', 'GRMN', 'GS', 'GT', 'GWW', 'HAL', 'HAS', 'HBAN', 'HBI',
       'HCA', 'HCN', 'HCP', 'HD', 'HES', 'HIG', 'HII', 'HLT', 'HOG',
       'HOLX', 'HON', 'HPE', 'HPQ', 'HP', 'HRB', 'HRL', 'HRS', 'HSIC',
       'HST', 'HSY', 'HUM', 'IBM', 'ICE', 'IDXX', 'IFF', 'ILMN', 'INCY',
       'INFO', 'INTC', 'INTU', 'IPG', 'IP', 'IQV', 'IRM', 'IR', 'ISRG',
       'ITW', 'IT', 'IVZ', 'JBHT', 'JCI', 'JEC', 'JNJ', 'JNPR', 'JPM',
       'JWN', 'KEY', 'KHC', 'KIM', 'KLAC', 'KMB', 'KMI', 'KMX', 'KORS',
       'KO', 'KR', 'KSS', 'KSU', 'K', 'LB', 'LEG', 'LEN', 'LH', 'LKQ',
       'LLL', 'LLY', 'LMT', 'LNC', 'LNT', 'LOW', 'LRCX', 'LUK', 'LUV',
       'LYB', 'L', 'MAA', 'MAC', 'MAR', 'MAS', 'MAT', 'MA', 'MCD', 'MCHP',
       'MCK', 'MCO', 'MDLZ', 'MDT', 'MET', 'MGM', 'MHK', 'MKC', 'MLM',
       'MMC', 'MMM', 'MNST', 'MON', 'MOS', 'MO', 'MPC', 'MRK', 'MRO',
       'MSFT', 'MSI', 'MS', 'MTB', 'MTD', 'MU', 'MYL', 'M', 'NAVI', 'NBL',
       'NCLH', 'NDAQ', 'NEE', 'NEM', 'NFLX', 'NFX', 'NI', 'NKE', 'NLSN',
       'NOC', 'NOV', 'NRG', 'NSC', 'NTAP', 'NTRS', 'NUE', 'NVDA', 'NWL',
       'NWSA', 'NWS', 'OKE', 'OMC', 'ORCL', 'ORLY', 'OXY', 'O', 'PAYX',
       'PBCT', 'PCAR', 'PCG', 'PCLN', 'PDCO', 'PEG', 'PEP', 'PFE', 'PFG',
       'PGR', 'PG', 'PHM', 'PH', 'PKG', 'PKI', 'PLD', 'PM', 'PNC', 'PNR',
       'PNW', 'PPG', 'PPL', 'PRGO', 'PRU', 'PSA', 'PSX', 'PVH', 'PWR',
       'PXD', 'PX', 'PYPL', 'QCOM', 'QRVO', 'RCL', 'REGN', 'REG', 'RE',
       'RF', 'RHI', 'RHT', 'RJF', 'RL', 'RMD', 'ROK', 'ROP', 'ROST',
       'RRC', 'RSG', 'RTN', 'SBAC', 'SBUX', 'SCG', 'SCHW', 'SEE', 'SHW',
       'SIG', 'SJM', 'SLB', 'SLG', 'SNA', 'SNI', 'SNPS', 'SO', 'SPGI',
       'SPG', 'SRCL', 'SRE', 'STI', 'STT', 'STX', 'STZ', 'SWKS', 'SWK',
       'SYF', 'SYK', 'SYMC', 'SYY', 'TAP', 'TDG', 'TEL', 'TGT', 'TIF',
       'TJX', 'TMK', 'TMO', 'TPR', 'TRIP', 'TROW', 'TRV', 'TSCO', 'TSN',
       'TSS', 'TWX', 'TXN', 'TXT', 'T', 'UAA', 'UAL', 'UA', 'UDR', 'UHS',
       'ULTA', 'UNH', 'UNM', 'UNP', 'UPS', 'URI', 'USB', 'UTX', 'VAR',
       'VFC', 'VIAB', 'VLO', 'VMC', 'VNO', 'VRSK', 'VRSN', 'VRTX', 'VTR',
       'VZ', 'V', 'WAT', 'WBA', 'WDC', 'WEC', 'WFC', 'WHR', 'WLTW', 'WMB',
       'WMT', 'WM', 'WRK', 'WU', 'WYNN', 'WYN', 'WY', 'XEC', 'XEL',
       'XLNX', 'XL', 'XOM', 'XRAY', 'XRX', 'XYL', 'YUM', 'ZBH', 'ZION',
       'ZTS'], dtype='<U5')

In [170]:
#Quantas ações começam com a letra “A”? 
def countA(array):
    count = 0
    for item in array:
        if item[0].startswith('A'):
            count +=1
    return count

In [171]:
countA(b)

59

In [116]:
#Quantas ações começam com a letra “A”? poderia apenas olhar na tabela
data.groupby(['Name']).count().head(61)

      date  open  high   low  close  volume
Name
A     1259  1259  1259  1259   1259    1259
AAL   1259  1259  1259  1259   1259    1259
AAP   1259  1259  1259  1259   1259    1259
AAPL  1259  1259  1259  1259   1259    1259
ABBV  1259  1259  1259  1259   1259    1259
...    ...   ...   ...   ...    ...     ...
AXP   1259  1259  1259  1259   1259    1259
AYI   1259  1259  1259  1259   1259    1259
AZO   1259  1259  1259  1259   1259    1259
BA    1259  1259  1259  1259   1259    1259
BAC   1259  1259  1259  1259   1259    1259

[61 rows x 6 columns]

In [267]:
#Com qual frequência o preço mais alto do dia da ação também é o preço de fechamento?

In [133]:
(data['close']==data['high']).value_counts()

False    611620
True       7420
dtype: int64

In [183]:
(7420/(7420+611620))*100

1.1986301369863013

In [387]:
#Em qual dia a ação da Apple mais subiu entre a abertura e o fechamento, de forma absoluta?

In [338]:
apple=data.loc[data["Name"]=="AAPL"]
apple

            date      open      high       low     close     volume  Name
1259  2013-02-08   67.7142   68.4014   66.8928   67.8542  158168416  AAPL
1260  2013-02-11   68.0714   69.2771   67.6071   68.5614  129029425  AAPL
1261  2013-02-12   68.5014   68.9114   66.8205   66.8428  151829363  AAPL
1262  2013-02-13   66.7442   67.6628   66.1742   66.7156  118721995  AAPL
1263  2013-02-14   66.3599   67.3771   66.2885   66.6556   88809154  AAPL
...          ...       ...       ...       ...       ...        ...   ...
2513  2018-02-01  167.1650  168.6200  166.7600  167.7800   47230787  AAPL
2514  2018-02-02  166.0000  166.8000  160.1000  160.5000   86593825  AAPL
2515  2018-02-05  159.1000  163.8800  156.0000  156.4900   72738522  AAPL
2516  2018-02-06  154.8300  163.7200  154.0000  163.0300   68243838  AAPL
2517  2018-02-07  163.0850  163.4000  159.0685  159.5400   51608580  AAPL

[1259 rows x 7 columns]

In [382]:
apple_diferenca=(apple['close']-apple['open'])
apple_diferenca

1259    0.1400
1260    0.4900
1261   -1.6586
1262   -0.0286
1263    0.2957
         ...
2513    0.6150
2514   -5.5000
2515   -2.6100
2516    8.2000
2517   -3.5450
Length: 1259, dtype: float64

In [383]:
apple_diferenca=pd.DataFrame(apple_diferenca)

In [384]:
apple_diferenca.columns = ['diferenca']
apple_diferenca.sort_values(by='diferenca',ascending= False)

      diferenca
1898       8.25
2516       8.20
2327       3.98
1721       3.93
2448       3.76
...         ...
2393      -4.58
1897      -4.67
2514      -5.50
2350      -6.21
1899      -7.37

[1259 rows x 1 columns]

In [385]:
apple[apple.index == 1898]

            date   open   high   low   close     volume  Name
1898  2015-08-24  94.87  108.8  92.0  103.12  162206292  AAPL

In [268]:
#Em média, qual o volume diário de transações das ações da AAPL?
media_Vol = data.filter(items=['Name','volume'])\
                  .groupby(['Name']).mean()
media_Vol.head(5)

            volume
Name
A     2.338039e+06
AAL   9.390321e+06
AAP   1.078043e+06
AAPL  5.404790e+07
ABBV  7.870683e+06

In [246]:
#Quantas ações tem 1, 2, 3, 4 e 5 caracteres em seu nome, respectivamente?
type(b)

numpy.ndarray

In [248]:
serie_tra = pd.Series(b) 
serie_tra.str.len().value_counts()

3    323
4    117
2     50
1     10
5      5
dtype: int64